ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
  unsigned long servoActionLast = millis();
  

  uint32_t controlTask_stackSizeIdx_u32 = 0;
  float previousLoadcellReadingInKg_fl32 = 0.0f;


  float effect_force_fl32;
  float effect_pos_fl32;
  EffectOffsets_t effectOffsets_st;
  EndstopBehavior_t endstopBehavior_st; 
  RudderOffsets_t rudderOffsets_st;
  int32_t Position_effect;
  int32_t bpTriggerValue_u8;
  int32_t BP_trigger_min;
  int32_t BP_trigger_max;
  int32_t Position_check;
  int32_t Rudder_real_poisiton;
  float joystickNormalizedToInt32_orig;
  float joystickfrac;
  float joystickNormalizedToInt32_eval;
  uint16_t joystickNormalizedToUInt16 = 0;
  int32_t ABS_trigger_value;

  uint8_t sendPedalStructsViaSerialCounter_u8 = 0;
  uint8_t sendJoystickDataCounter_u8 = 0;

  
  global_dap_config_class.getConfig(&dap_config_pedalUpdateTask_st, 500);

  static const uint8_t joystickSendCounterMax_u8 = (REPETITION_INTERVAL_JOYSTICKOUTPUT_TASK_IN_US_I64) / (REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64) ;
  static const uint8_t serialSendCounterMax_u8 = (REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US_I64) / (REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64) ;

  
  

  
  static float changeVelocity = 0.0f;
  static float normalizedPedalReading_fl32 = 0.0f;
  static float stepperPosFraction_fl32 = 0.0f;
  static bool sendBasicFlag_b = false;
  static bool sendExtendedFlag_b = false;
  static int32_t stepperPosCurrent_i32;
  static uint32_t cycleCount_u32 = 0;

  AdmittanceDebugState_t admittanceDebugInfo_st;
  AdmittanceStates_t admittanceStates_st;
  
  for (;;)
  {


    // trigger task 
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {

      // if new data package is available, update the local config
      if (xQueueReceive(s_configUpdateSendToPedalUpdateTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS)
      {
        dap_config_pedalUpdateTask_st = configPackage_st.config_st;

        // activate profiler depending on pedal config
        if (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER_U8) 
        {
          profiler_pedalUpdateTask.activate( true );
        }
        else
        {
          profiler_pedalUpdateTask.activate( false );
        }

        ActiveSerial->println("Update config: pedal update task");



        // update the calc params
        ActiveSerial->println("Updating the calc params");
        //ActiveSerial->print("save to eeprom tag:");
        //ActiveSerial->println(dap_config_pedalUpdateTask_st.payloadHeader_st.storeToEeprom_u8);
        saveToEEPRomDuration = millis();
        
        if (true == dap_config_pedalUpdateTask_st.payloadHeader_st.storeToEeprom_u8)
        {
          dap_config_pedalUpdateTask_st.payloadHeader_st.storeToEeprom_u8 = false; // set to false, thus at restart existing EEPROM config isn't restored to EEPROM
          uint16_t crc = checksumCalculator_u16((uint8_t*)(&(dap_config_pedalUpdateTask_st.payloadHeader_st)), sizeof(dap_config_pedalUpdateTask_st.payloadHeader_st) + sizeof(dap_config_pedalUpdateTask_st.payloadPedalConfig_st));
          dap_config_pedalUpdateTask_st.payloadFooter_st.checkSum_u16 = crc;
          global_dap_config_class.setConfig(dap_config_pedalUpdateTask_st);
          ActiveSerial->println("Saving into EEPROM");
          global_dap_config_class.storeConfigToEeprom();
          
          saveToEEPRomDuration = 0;
        }
        
        updatePedalCalcParameters(); // update the calc parameters
        moveSlowlyToPosition_b = true;

        // enable/disable step loss recovery and crash
        stepper->configSteplossRecovAndCrashDetection(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.stepLossFunctionFlags_u8);
        stepper->configSetProfilingFlag( (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER_U8) );

        // reset all servo alarms
        if ( (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS_U8) )
        {
          ActiveSerial->println("Set clear alarm history flag");
          stepper->clearAllServoAlarms();
          delay(1000); // makes sure the routine has finished

          DapConfig_t tmp;
          global_dap_config_class.getConfig(&tmp, 500);
          tmp.payloadPedalConfig_st.debugFlags0_u8 &= ( ~(uint8_t)DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS_U8); // clear the debug bit
          //global_dap_config_class.setConfig(tmp);

          configDataPackage_t configPackage_st;
          configPackage_st.config_st = tmp;
          xQueueSend(s_configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);
        }

        // reset all servo alarms
        if ( (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_RESET_SERVO_TO_FACTORY_U8) )
        {
          DapConfig_t tmp;
          global_dap_config_class.getConfig(&tmp, 500);
          tmp.payloadPedalConfig_st.debugFlags0_u8 &= ( ~(uint8_t)DEBUG_INFO_0_RESET_SERVO_TO_FACTORY_U8); // clear the debug bit
          tmp.payloadHeader_st.storeToEeprom_u8 = 1;
          //global_dap_config_class.setConfig(tmp);

          configDataPackage_t configPackage_st;
          configPackage_st.config_st = tmp;
          xQueueSend(s_configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);

          delay(500);

          global_dap_config_class.storeConfigToEeprom();

          ActiveSerial->println("Resetting servo parameters to factory values");
          stepper->resetServoParametersToFactoryValues();
        }

        

        // print all servo parameters for debug purposes
        if ( (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_LOG_ALL_SERVO_PARAMS_U8) )
        {
          DapConfig_t tmp;
          global_dap_config_class.getConfig(&tmp, 500);
          tmp.payloadPedalConfig_st.debugFlags0_u8 &= ( ~(uint8_t)DEBUG_INFO_0_LOG_ALL_SERVO_PARAMS_U8); // clear the debug bit
          //global_dap_config_class.setConfig(tmp);

