ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
      // read loadcell data, when available
      profiler_pedalUpdateTask.start(2);
      if (xQueueReceive(s_loadcellDataQueue, &loadcellDataReceived_st, (TickType_t)0) == pdPASS) {
        loadcellReading = loadcellDataReceived_st.loadcellReadingInKg_fl32;
      }
      profiler_pedalUpdateTask.end(2);


      // start profiler 3, loadcell reading conversion
      profiler_pedalUpdateTask.start(3);

      // Convert loadcell reading to pedal force
      float sledPosition = sledPositionInMM(stepper, &dap_config_pedalUpdateTask_st, motorRevolutionsPerSteps_fl32);
      float pedalInclineAngleInDeg_fl32 = pedalInclineAngleDeg(sledPosition, &dap_config_pedalUpdateTask_st);
      float pedalForce_fl32 = convertToPedalForce(loadcellReading, sledPosition, &dap_config_pedalUpdateTask_st);
      float d_phi_d_x = convertToPedalForceGain(sledPosition, &dap_config_pedalUpdateTask_st);

      // compute gain for horizontal foot model
      float b = (float)dap_config_pedalUpdateTask_st.payloadPedalConfig_st.lengthPedalB_i16;
      float d = (float)dap_config_pedalUpdateTask_st.payloadPedalConfig_st.lengthPedalD_i16;
      float d_x_hor_d_phi = -(float)(b+d) * isin(pedalInclineAngleInDeg_fl32);
      d_x_hor_d_phi *= DEG_TO_RAD_FL32; // inner derivative

      // start profiler 3, loadcell reading conversion
      profiler_pedalUpdateTask.end(3);

      // start profiler 4, loadcell reading filtering
      profiler_pedalUpdateTask.start(4);
      
      // Do the loadcell signal filtering
      float alpha_exp_filter = 1.0f - ( (float)dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfModelNoise_u8) / 5000.0f;
      static float lastPedalForce_fl32 = 0.0f;
      // const velocity model denoising filter
      switch (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfModelOrder_u8) {
        case 0: // const. velocity Kalman filter
          filteredReading = kalman->filteredValue(pedalForce_fl32, 0.0f, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfModelNoise_u8);
          changeVelocity = kalman->changeVelocity();
          break;
        case 1: // const. accel. Kalman filter
          filteredReading = kalman_2nd_order->filteredValue(pedalForce_fl32, 0.0f, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfModelNoise_u8);
          changeVelocity = kalman_2nd_order->changeVelocity();
          break;
        case 2: // exponential filter
          filteredReading_exp_filter = filteredReading_exp_filter * alpha_exp_filter + pedalForce_fl32 * (1.0f-alpha_exp_filter);
          filteredReading = filteredReading_exp_filter;
          changeVelocity = (filteredReading - lastPedalForce_fl32) /  ((float)REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64 * 1e-6f);
          lastPedalForce_fl32 = filteredReading;
          break;
        default: // No filter
          filteredReading = pedalForce_fl32;
          changeVelocity = (filteredReading - lastPedalForce_fl32) /  ((float)REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64 * 1e-6f);
          lastPedalForce_fl32 = filteredReading;
      }
      //write filter reading into calculation_st
      dap_calculationVariables_st.currentForceReading_fl32=filteredReading;


      // end profiler 4, loadcell reading filtering
      profiler_pedalUpdateTask.end(4);


      
      float FilterReadingJoystick=0.0f;
      if(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfJoystick_u8==1)
      {
        FilterReadingJoystick=kalman_joystick->filteredValue(filteredReading,0.0f,dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfModelNoiseJoystick_u8);

      }
      else
      {
        FilterReadingJoystick=filteredReading;
      }


      //if filtered reading > min force, mark the servo was in aciton
      if(filteredReading > dap_config_pedalUpdateTask_st.payloadPedalConfig_st.preloadForce_fl32)
      {
        servoActionLast = millis();
      }

      // wakeup process
      if ((filteredReading > STEPPER_WAKEUP_FORCE) && (stepper->servoStatus == SERVO_IDLE_NOT_CONNECTED))
      {
        Buzzer.single_beep_tone(770, 100);
        delay(300);
        Buzzer.single_beep_tone(770, 100);
        ActiveSerial->println("Wake up servo, restart esp.");
        delay(1000);
        ESP.restart();
      }

      // pedal not in action, disable pedal power
      uint32_t pedalIdleTimout = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.servoIdleTimeout_u8 * 60 * 1000; // timeout in ms
      if ((stepper->servoStatus == SERVO_CONNECTED) && ((millis() - servoActionLast) > pedalIdleTimout) && (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.servoIdleTimeout_u8 != 0))
      {
        stepper->servoIdleAction();
        stepper->servoStatus = SERVO_IDLE_NOT_CONNECTED;
        Buzzer.single_beep_tone(770, 100);
        delay(300);
        #ifdef USING_LED
          pixels.setPixelColor(0, 0xff, 0x00, 0x00); // show red
          pixels.show();
        #endif
        Buzzer.single_beep_tone(770, 100);
        ActiveSerial->println("Servo idle timeout reached. To restart pedal, please apply pressure.");
      }
      //emergency button

      #ifdef EMERGENCY_PIN_U8
        if ((stepper->servoStatus == SERVO_CONNECTED) && (stepper->servoStatus != SERVO_FORCE_STOP) && (digitalRead(EMERGENCY_PIN_U8) == LOW))
        {
          stepper->servoIdleAction();
          stepper->servoStatus = SERVO_FORCE_STOP;
          Buzzer.single_beep_tone(770, 100);
          delay(300);
          #ifdef USING_LED
            pixels.setPixelColor(0, 0xff, 0x00, 0x00); // show red
            pixels.show();
          #endif
          Buzzer.single_beep_tone(770, 100);
          ActiveSerial->println("Servo force Stoped.");
        }
      #endif
      //float FilterReadingJoystick=averagefilter_joystick.process(filteredReading);


      // start profiler 4, movement strategy
      profiler_pedalUpdateTask.start(5);

      

      int32_t Position_Next = 0;
      float Position_Next_fl32 = 0.0f;

      // Adding effects
      effect_pos_fl32 = 0.0f;
      effect_force_fl32 = 0.0f;
      bool effectsCalculated_b=false;
      // only add force when not at min position 
      if(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.minForceForEffects_u8!=0)
      {
        if(filteredReading >= (float)dap_config_pedalUpdateTask_st.payloadPedalConfig_st.minForceForEffects_u8)
        {
          effectsCalculated_b = true;
        }
      }
      else
      {
        // accumulate force offsets
        effectsCalculated_b=true;
        //effect_pos_fl32 += _RPMOscillation.RPM_position_offset;
      }
      if(effectsCalculated_b)
      {
        effect_force_fl32 += absOscillation.absOscillationForceOffset_fl32;
        // accumulate position offsets
        effect_pos_fl32 += absOscillation.absOscillationPositionOffset_fl32;
        effect_pos_fl32 += _WSOscillation.wheelSlipOffset_fl32;
        effect_pos_fl32 += _BitePointOscillation.bitePointOffset_fl32;
        effect_pos_fl32 += customVibration1_.customVibrationOffset_fl32;
        effect_pos_fl32 += customVibration2_.customVibrationOffset_fl32;
        effect_pos_fl32 += customVibration3_.customVibrationOffset_fl32;
        effect_pos_fl32 += customVibration4_.customVibrationOffset_fl32;
        effect_pos_fl32 += _RPMOscillation.rpmPositionOffset_i32;
      }
      effect_pos_fl32 *= EFFECT_POSITION_SCALING_FACTOR_FL32;
      // write the effect offsets into a struct for debug output and potential use in other functions like the effect offset PID
      effectOffsets_st.forceOffset_kg_fl32 = effect_force_fl32;
      effectOffsets_st.forceOffset_Steps_fl32 = effect_pos_fl32;


      // chatter reduction gain, reduce the gain when chatter happened
      /*
      if (chatterReduction.checkForChatter(stepperPosCurrent_i32, esp_timer_get_time(), false))
      {
        effect_pos_fl32 *= chatterReduction.DynamicEffectGain();
      }
      */


      // --- Predictive Brake Resistor Activator ---
      uint32_t current_time_us = micros();
      bool brake_state = brakeController.Update(
          stepper->getServosPosError()
          , stepper->getServosPosErrorChangeRateInStepsPerSecond()
          , changeVelocity
          , stepper->getCurrentSpeedInHz()
          , ( (float)stepper->getServosVoltage() ) * 0.1f
          , current_time_us
      );
      #ifdef BRAKE_RESISTOR_PIN_U8
        if (brake_state) {
            digitalWrite(BRAKE_RESISTOR_PIN_U8, HIGH);
        } else {
            digitalWrite(BRAKE_RESISTOR_PIN_U8, LOW);
        }
      #endif

      
      // compute next position with PID strategy
      // MPC control strataegy for rudder
      int32_t positionWithoutEffect=0;
      if(dap_calculationVariables_st.rudderStatus_b || dap_calculationVariables_st.helicopterRudderStatus_b)
      {
        //
        endstopBehavior_st.stiffnessAtMaxTravel_Npermm_fl32 = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.endstopStiffness_kg_mm_u8 * 9.81f; 
        endstopBehavior_st.travelRange_mm_fl32 = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.endstopTravelRange_mm_u8;
        endstopBehavior_st.stiffnessAtMaxTravel_Npermm_fl32 = constrain(endstopBehavior_st.stiffnessAtMaxTravel_Npermm_fl32, 0.0f, 500.0f); // constrain the stiffness to a max value for safety
        endstopBehavior_st.travelRange_mm_fl32 = constrain(endstopBehavior_st.travelRange_mm_fl32, 0.0f, 10.0f); // constrain the stiffness to a max value for safety
        

        // rudder variables
        rudderOffsets_st.isRudderMode = false;
        rudderOffsets_st.centerPosition_01 = 0.0f;
        rudderOffsets_st.deadzone_01 = 0.0f;
        rudderOffsets_st.trimOffset_01 = 0.0f;

        // Pedal control algorithm
        Position_Next_fl32 = MoveByAdmittanceStrategy(
          filteredReading
          , stepper
          , &forceCurve
          , &dap_calculationVariables_st
          , &dap_config_pedalUpdateTask_st
          , effectOffsets_st
          , endstopBehavior_st
          , rudderOffsets_st
          , &admittanceDebugInfo_st
          , &admittanceStates_st
        ); 
        // Rudder only
        //Position_Next = MoveByForceTargetingStrategy(filteredReading, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, 0.0f/*effect_force*/, changeVelocity, d_phi_d_x, d_x_hor_d_phi);
        positionWithoutEffect=Position_Next_fl32;//send the value without rpm effect
        if(effectsCalculated_b)
        {
          //float effectsOffsetFiltered= effectOffsetPID.computeEffectOffset(effect_pos_fl32, &dap_calculationVariables_st);
          //Position_Next -= effectsOffsetFiltered;
          Position_Next_fl32 -= effect_pos_fl32;
        } 
        //if(effectsCalculated_b) Position_Next -= _RPMOscillation.RPM_position_offset;
      }
      else 
      {

        endstopBehavior_st.stiffnessAtMaxTravel_Npermm_fl32 = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.endstopStiffness_kg_mm_u8 * 9.81f; 
        endstopBehavior_st.travelRange_mm_fl32 = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.endstopTravelRange_mm_u8;

        endstopBehavior_st.stiffnessAtMaxTravel_Npermm_fl32 = constrain(endstopBehavior_st.stiffnessAtMaxTravel_Npermm_fl32, 0.0f, 500.0f); // constrain the stiffness to a max value for safety
        endstopBehavior_st.travelRange_mm_fl32 = constrain(endstopBehavior_st.travelRange_mm_fl32, 0.0f, 10.0f); // constrain the stiffness to a max value for safety
        

        // rudder variables
        rudderOffsets_st.isRudderMode = false;
        rudderOffsets_st.centerPosition_01 = 0.0f;
        rudderOffsets_st.deadzone_01 = 0.0f;
        rudderOffsets_st.trimOffset_01 = 0.0f;

        // Pedal control algorithm
        Position_Next_fl32 = MoveByAdmittanceStrategy(
          filteredReading
          , stepper
          , &forceCurve
          , &dap_calculationVariables_st
          , &dap_config_pedalUpdateTask_st
          , effectOffsets_st
          , endstopBehavior_st
          , rudderOffsets_st
          , &admittanceDebugInfo_st
          , &admittanceStates_st
        ); 
        
