ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
                if (expectedSize == 0)
                {
                  // Unknown payload type, this SOF is corrupt. Skip it and continue scanning.
                  buffer_idx++;
                  continue;
              }

              // ActiveSerial->println("2nd check passed");

              // C. Check if the full packet has arrived
                if (buffer_len < buffer_idx + expectedSize)
                {
                  // Full packet is not yet in the buffer, wait for more data
                  break;
              }

              // D. Check for valid End-of-Frame (EOF)
                if (rx_buffer[buffer_idx + expectedSize - 2] != EOF_BYTE_0_U8 || rx_buffer[buffer_idx + expectedSize - 1] != EOF_BYTE_1_U8)
                {
                  // EOF is wrong, this packet is corrupt. Skip the SOF and continue scanning.
                  buffer_idx++;
                  continue;
              }
              
              // --- We have a candidate packet! Now validate and process it. ---
              uint8_t* packet_start = &rx_buffer[buffer_idx];
              bool structIsValid = true;
              uint16_t received_crc = 0;
              uint16_t calculated_crc = 0;

              switch (payloadType) {
                  case DAP_PAYLOAD_TYPE_CONFIG_U8: {
                      DapConfig_t received_config;
                      memcpy(&received_config, packet_start, sizeof(DapConfig_t));
                      
                      calculated_crc = checksumCalculator_u16((uint8_t*)(&(received_config.payloadHeader_st)), sizeof(received_config.payloadHeader_st) + sizeof(received_config.payloadPedalConfig_st));
                      received_crc = received_config.payloadFooter_st.checkSum_u16;

                        if (calculated_crc != received_crc || received_config.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
                        {
                          structIsValid = false;
                        }
                        else
                        {
                          // --- VALID CONFIG PACKET ---
                        ActiveSerial->println("Updating pedal config from serial");
                        //global_dap_config_class.setConfig(received_config);

                        configDataPackage_t configPackage_st;
                        configPackage_st.config_st = received_config;
                        xQueueSend(s_configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);
                        
                        if (received_config.payloadHeader_st.storeToEeprom_u8 == 1)
                        {
                          Buzzer.single_beep_tone(700, 100);
                        }
                      }
                      break;
                  }
                  case DAP_PAYLOAD_TYPE_ACTION_U8: {
                      DapActions_t received_action;
                      memcpy(&received_action, packet_start, sizeof(DapActions_t));

                      // ActiveSerial->println("Action received");

                      calculated_crc = checksumCalculator_u16((uint8_t*)(&(received_action.payloadHeader_st)), sizeof(received_action.payloadHeader_st) + sizeof(received_action.payloadPedalAction_st));
                      received_crc = received_action.payloadFooter_st.checkSum_u16;

                        if (calculated_crc != received_crc || received_action.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
                        {
                          structIsValid = false;
                        }
                        else
                        {
                          // --- VALID ACTION PACKET ---
                          // Place your extensive action handling logic here
                          // For clarity, this could be moved to its own function: handleActionPacket(received_action);
                          if (received_action.payloadPedalAction_st.systemAction_u8 == 2)
                          {
                              ActiveSerial->println("ESP restart by user request");
                              ESP.restart();
                          }

                          //3= Wifi OTA
                          #ifdef ESPNOW_Enable
                          if (received_action.payloadPedalAction_st.systemAction_u8==(uint8_t)PedalSystemAction::ENABLE_OTA)
                          {
                            ActiveSerial->println("Get OTA command");
                            g_OTA_enable_b=true;
                            //g_OTA_enable_start=true;
                            g_ESPNow_OTA_enable=false;
                          }
                          #endif
                          //4 Enable pairing
                          if (received_action.payloadPedalAction_st.systemAction_u8==4)
                          {
                            #ifdef ESPNow_Pairing_function
                              ActiveSerial->println("Get Pairing command");
                              software_pairing_action_b=true;
                            #endif
                            #ifndef ESPNow_Pairing_function
                              ActiveSerial->println("no supporting command");
                            #endif
                          }
                          
                          if (received_action.payloadPedalAction_st.systemAction_u8==(uint8_t)PedalSystemAction::ESP_BOOT_INTO_DOWNLOAD_MODE)
                          {
                            #ifdef ESPNow_S3
                              ActiveSerial->println("Restart into Download mode");
                              delay(1000);
                              REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
                              ESP.restart();
                            #else
                              ActiveSerial->println("Command not supported");
                              delay(1000);
                            #endif
                            //ESPNOW_BootIntoDownloadMode = false;
                          }
                          if (received_action.payloadPedalAction_st.systemAction_u8 == (uint8_t)PedalSystemAction::PRINT_PEDAL_INFO)
                          {
                            char logString[200];
                            snprintf(logString, sizeof(logString),
                                    "Pedal ID: %d\nBoard: %s\nLoadcell shift= %.3f kg\nLoadcell variance= %.3f kg\nPSU voltage:%.1f V\nMax endstop:%lu\nCurrentPos:%lu\n\0",
                                     sct_dap_config_st.payloadPedalConfig_st.pedalType_u8, CONTROL_BOARD, loadcell->getBiasEstimate(), loadcell->getStandardDeviationEstimate(), ((float)stepper->getServosVoltage() / 10.0f), dap_calculationVariables_st.stepperPosMaxEndstop_i32, dap_calculationVariables_st.currentPedalPosition_u32);
                            ActiveSerial->println(logString);
                          }

                          // trigger ABS effect
                          if (received_action.payloadPedalAction_st.triggerAbs_u8>0)
                          {
                            // ActiveSerial->println("Trigger ABS");
                            absOscillation.trigger();
                            if(received_action.payloadPedalAction_st.triggerAbs_u8>1)
                            {
                              dap_calculationVariables_st.trackCondition_u8=received_action.payloadPedalAction_st.triggerAbs_u8-1;
                            }
                            else
                            {
                              dap_calculationVariables_st.trackCondition_u8=received_action.payloadPedalAction_st.triggerAbs_u8=0;
                            }
                          }
                          //RPM effect
                          _RPMOscillation.rpmValue_fl32=received_action.payloadPedalAction_st.rpm_u8;
                          //G force effect
                          gForceEffect_.gValue_fl32=received_action.payloadPedalAction_st.gValue_u8-128;       
                          //wheel slip
                          if (received_action.payloadPedalAction_st.wheelSlip_u8)
                          {
                            _WSOscillation.trigger();
                          }     
                          //Road impact
                          if(dap_calculationVariables_st.rudderStatus_b==false)
                          {
                            roadImpactEffect_.roadImpactValue_u8=received_action.payloadPedalAction_st.impactValue_u8;
                          }
                          else
                          {

