ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
                          }
                          
                          // trigger system identification
                          if (received_action.payloadPedalAction_st.startSystemIdentification_u8)
                          {
                            systemIdentificationMode_b = true;
                          }
                          // trigger Custom effect effect 1
                          if (received_action.payloadPedalAction_st.triggerCv1_u8) customVibration1_.trigger();
                          // trigger Custom effect effect 2
                          if (received_action.payloadPedalAction_st.triggerCv2_u8) customVibration2_.trigger();
                          // trigger Custom effect effect 3
                          if (received_action.payloadPedalAction_st.triggerCv3_u8) customVibration3_.trigger();
                          // trigger Custom effect effect 4
                          if (received_action.payloadPedalAction_st.triggerCv4_u8) customVibration4_.trigger();
                          // trigger return pedal position
                          if (received_action.payloadPedalAction_st.returnPedalConfig_u8)
                          {
                          
                            DapConfig_t * dap_config_st_local_ptr;
                            dap_config_st_local_ptr = &sct_dap_config_st;
                            dap_config_st_local_ptr->payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
                            dap_config_st_local_ptr->payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
                            dap_config_st_local_ptr->payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
                            dap_config_st_local_ptr->payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
                            uint16_t crc = checksumCalculator_u16((uint8_t*)(&(sct_dap_config_st.payloadHeader_st)), sizeof(sct_dap_config_st.payloadHeader_st) + sizeof(sct_dap_config_st.payloadPedalConfig_st));
                            dap_config_st_local_ptr->payloadFooter_st.checkSum_u16 = crc;

                            // suspend the serial Tx task so that data can properly be send
                            vTaskSuspend(handle_serialCommunicationTx);
                            delay(50);
                            // Config reply goes via CDC TX (always works)
                            ActiveSerial->write((char*)dap_config_st_local_ptr, sizeof(DapConfig_t));
                            delay(50);
                            vTaskResume(handle_serialCommunicationTx);

                          }
                          #ifdef ESPNOW_Enable
                            if(received_action.payloadPedalAction_st.rudderAction_u8==1)//Enable Rudder
                            {
                              if(dap_calculationVariables_st.rudderStatus_b==false)
                              {
                                dap_calculationVariables_st.rudderStatus_b=true;
                                ActiveSerial->println("Rudder on");
                                Rudder_initializing=true;
                                moveSlowlyToPosition_b=true;
                                //ActiveSerial->print("status:");
                                //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                              }
                              else
                              {
                                dap_calculationVariables_st.rudderStatus_b=false;
                                ActiveSerial->println("Rudder off");
                                Rudder_deinitializing=true;
                                moveSlowlyToPosition_b=true; 

                                //ActiveSerial->print("status:");
                                //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                              }
                            }
                            if(received_action.payloadPedalAction_st.rudderBrakeAction_u8==1)
                            {
                              if(dap_calculationVariables_st.rudderBrakeStatus_b==false&&dap_calculationVariables_st.rudderStatus_b==true)
                              {
                                dap_calculationVariables_st.rudderBrakeStatus_b=true;
                                ActiveSerial->println("Rudder brake on");
                                //ActiveSerial->print("status:");
                                //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                              }
                              else
                              {
                                dap_calculationVariables_st.rudderBrakeStatus_b=false;
                                ActiveSerial->println("Rudder brake off");
                                //ActiveSerial->print("status:");
                                //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                              }
                            }
                            //clear rudder status
                            if(received_action.payloadPedalAction_st.rudderAction_u8==2)
                            {
                              dap_calculationVariables_st.rudderStatus_b=false;
                              dap_calculationVariables_st.rudderBrakeStatus_b=false;
                              ActiveSerial->println("Rudder Status Clear");
                              Rudder_deinitializing=true;
                              moveSlowlyToPosition_b=true;

                            }
                          #endif
                          
                          

                          
                      }
                      break;
                  }
                  case DAP_PAYLOAD_TYPE_ACTION_OTA_U8:{
                    memcpy(&dap_action_ota_st, packet_start, sizeof(DapActionOta_t));
                    ActiveSerial->println("Get OTA command");
                    buzzerBeepAction_b=true;

